Revit 2026 API

# DocumentPathName Property

---

The fully qualified path of the document's disk file.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string PathName { get; }
```
```vb
Public ReadOnly Property PathName As String
	Get
```
```cpp
public:
property String^ PathName {
	String^ get ();
}
```
```fsharp
member PathName : string with get
```

#### Property Value

String

This string is empty if the project has not been saved or does not have a disk file associated with it yet. Note that the pathname will be empty if a document is detached. See IsDetached.

#### Reference

Document Class

Autodesk.Revit.DB Namespace